Revit 2026 API

# StructuralNumberingSchemas Properties

---

The NumberingSchemaTypesStructuralNumberingSchemas type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Rebar | Built-in schema used for numbering rebar elements |
|  | RebarCoupler | Built-in schema used for numbering rebar coupler elements |
|  | ReinforcementFabric | Built-in schema used for numbering fabric reinforcement elements |

#### Reference

NumberingSchemaTypesStructuralNumberingSchemas Class

Autodesk.Revit.DB Namespace